; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v3)
		(pred_1 ?v2)
		(pred_3 ?v1)
		(pred_6 ?v1)
		(pred_5 ?v2 ?v1)
		(pred_2)
		(pred_4 ?v2))

   (:action op_1
       :parameters  (?v8 ?v6)
       :precondition (and (not-eq ?v8 ?v6) 
                          (pred_3 ?v8) (pred_3 ?v6) (pred_6 ?v8))
       :effect (and  (pred_6 ?v6)
		     (not (pred_6 ?v8))))


   (:action op_2
       :parameters (?v4 ?v7)
       :precondition  (and  (pred_1 ?v4) (pred_3 ?v7)
			    (pred_5 ?v4 ?v7) (pred_6 ?v7) (pred_2))
       :effect (and (pred_4 ?v4)
		    (not (pred_5 ?v4 ?v7)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v4  ?v7)
       :precondition  (and  (pred_1 ?v4) (pred_3 ?v7)
			    (pred_4 ?v4) (pred_6 ?v7))
       :effect (and (pred_5 ?v4 ?v7)
		    (pred_2)
		    (not (pred_4 ?v4)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_01 obj_04 obj_05 
          obj_03 obj_02 
)
(:init
(pred_3 obj_01)
(pred_3 obj_04)
(pred_3 obj_05)
(pred_1 obj_03)
(pred_1 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_2)
(pred_5 obj_03 obj_04)
(pred_5 obj_02 obj_04)
(pred_6 obj_01)
)
(:goal
(and
(pred_5 obj_03 obj_05)
(pred_5 obj_02 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_05) (pred_6 obj_01))
    (sometime-before  (pred_5 obj_02 obj_01) (pred_6 obj_05))
  )
)
)

; plan
1. (op_1 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_04)
   goals met: 0 of 2
2. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_2)
   added: (pred_4 obj_03)
   goals met: 0 of 2
3. (op_1 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 0 of 2
4. (op_3 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_5 obj_03 obj_05) (pred_2)
   goals met: 1 of 2
5. (op_1 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 1 of 2
6. (op_2 obj_02 obj_04)
   deleted: (pred_5 obj_02 obj_04) (pred_2)
   added: (pred_4 obj_02)
   goals met: 1 of 2
7. (op_1 obj_04 obj_01)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_01)
   goals met: 1 of 2
8. (op_3 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_5 obj_02 obj_01) (pred_2)
   goals met: 2 of 2
